Description: Creates installer package for kicad
Identifier: com.github.pnerum.pkg.kicad
MinimumVersion: "2.3"
ParentRecipe: com.github.pnerum.download.kicad

Input:
  NAME: KiCad
  PKGID: org.kicad.kicad
  
Process:

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkg_root"
      pkgdirs:
        Applications: "0755"
        Applications/KiCad: "0755"
      
  - Processor: Copier
    Arguments:
      source_path: "%pathname%/%NAME%/%NAME%.app"
      destination_path: "%pkgroot%/Applications/%NAME%/%NAME%.app"
      
  - Processor: Symlinker
    Arguments:
      source_path: "/Applications/%NAME%/%NAME%.app/Contents/Applications/gerbview.app"
      destination_path: "%pkgroot%/Applications/%NAME%/GerbView.app"
    
  - Processor: Symlinker
    Arguments:
      source_path: "/Applications/%NAME%/%NAME%.app/Contents/Applications/bitmap2component.app"
      destination_path: "%pkgroot%/Applications/%NAME%/Image Converter.app"
  
  - Processor: Symlinker
    Arguments:
      source_path: "/Applications/%NAME%/%NAME%.app/Contents/Applications/pl_editor.app"
      destination_path: "%pkgroot%/Applications/%NAME%/Page Layout Editor.app"
      
  - Processor: Symlinker
    Arguments:
      source_path: "/Applications/%NAME%/%NAME%.app/Contents/Applications/pcb_calculator.app"
      destination_path: "%pkgroot%/Applications/%NAME%/PCB Calculator.app"
      
  - Processor: Symlinker
    Arguments:
      source_path: "/Applications/%NAME%/%NAME%.app/Contents/Applications/pcbnew.app"
      destination_path: "%pkgroot%/Applications/%NAME%/PCB Editor.app"
      
  - Processor: Symlinker
    Arguments:
      source_path: "/Applications/%NAME%/%NAME%.app/Contents/Applications/eeschema.app"
      destination_path: "%pkgroot%/Applications/%NAME%/Schematic Editor.app"
      
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - path: "Applications"
            user: "root"
            group: "wheel"
            mode: "0755"
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "%PKGID%"
        options: "purge_ds_store"
        pkgdir: "%RECIPE_CACHE_DIR%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkg_root"
